user/tutorials/Nike/ISAT_paper/2D_shock/shockDroplet_codestream_longer_C12test_C_2d_1C_low_T_ISAT_3e_2/constant/chem
elements        
3
(
H
O
C
)
;


species        2(C12H26 N2);


reactions
{
}

Tlow            200;
Thigh           6000;

